cases/cfd/fluids/backstep_laminar_armaly_re389/solution/case/0/p
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions [0 2 -2 0 0 0 0];

internalField uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    "(upper_wall|lower_wall_upstream|lower_wall_downstream|step_face)"
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}
