cases/cfd/fluids/backstep_laminar_armaly_re389/solution/case/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

// Steady laminar flow (Re = 389). No RANS model, no k/omega/nut fields.
simulationType  laminar;
