cases/cfd/fluids/backstep_laminar_armaly_re389/solution/case/system/WallShear
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object WallShear;
}
type wallShearStress;
libs (fieldFunctionObjects);
patches (lower_wall_downstream lower_wall_upstream step_face upper_wall);
writeControl timeStep;
writeFields true;
