cases/cfd/fluids/backstep_laminar_armaly_re389/solution/case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     simpleFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
// A CAP, not the stopping rule. `residualControl` in fvSolution is what stops
// this run: it is first met at iteration 2664 on the domain image (measured on
// this case's own shipped mesh, #286), and the cap sits above twice that. It
// used to be 3000, which this case did converge under -- by 13%, on one host.
// That is not a margin. The iteration count is not a constant of the case:
// GAMG agglomeration and the linear-solver path move it between OpenFOAM
// builds, and `lid_driven_cavity_ghia_re100` is what the same margin looks
// like once it goes negative -- it stopped on its cap for its whole life with
// nothing recording that it had (#266, #273). Raising the cap changes no
// number here: re-measured at 6000, the run still stops at the same 2664
// iterations and still reports reattachment_length_xr_over_h = 8.341731.
endTime         6000;

deltaT          1;

writeControl    timeStep;
writeInterval   1000;

purgeWrite      2;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

functions
{
    wallShearStress1
    {
        type            wallShearStress;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        writeFields     true;
        patches         (lower_wall_downstream);
    }

    // Sample wallShearStress on the lower-wall-downstream patch -> raw file
    // with (x y z tau_x tau_y tau_z) per face. Used for x_reattach extraction.
    wallSurfaceSample
    {
        type            surfaces;
        libs            (sampling);
        writeControl    writeTime;
        interpolationScheme cellPoint;
        surfaceFormat   raw;
        fields          (wallShearStress p);
        surfaces
        {
            wallSurface
            {
                type    patch;
                patches (lower_wall_downstream);
                interpolate false;
            }
        }
    }
}
